app/Controllers/HabitController.php

SELECT *
FROM "habits"
WHERE "user_id" = '32'
SELECT *
FROM "user_reward_view"
WHERE "user_id" = '32'
---
    public function habit()
    {
        $habits = new HabitsModel();
        $UserRewards = new UserRewardViewModel();

        $UserHabitPercentage = new UserHabitPercentageModel();
        $currentUserId = session()->get('id'); //this will have user_id of current user which is logged in

        $data['habits'] = $habits->where('user_id', $currentUserId)->findAll();
        $data['rewards'] = $UserRewards->where('user_id', $currentUserId)->findAll();