app/Controllers/PostController.php

SELECT COUNT(*) AS "numrows" FROM "post_summary"
---
    public function totalPost(): string
    {
        $postModel = new PostSummaryModel();
        return $postModel->countAll();

SELECT COUNT(*) AS "numrows" FROM "post_summary"
---
    public function get_post($page)
    {
        $postModel = new PostSummaryModel();
        $commentModel = new CommentsModel();

        $count = 10; //count of feed page

        if ($page != 'last') //for page 1,2,3 so on
        {
            //! this is for those page which are not at last

            $offset = ($page - 1) * $count;
            $data['post_data'] = $postModel->getPosts($count, $offset);
            $data['comment_data'] = null;

            foreach ($data['post_data'] as $post) {
                $index = array_search($post, $data['post_data']);
                $data['comment_data'][$index] = $commentModel->getTopCommentsWithUserInfo($post['post_id']);
            }

            echo view('components/post', $data);
        } else { // for last page

            //! for last page on site or (if total post are less then 10)

            //* now will get total post count from db
            $totalPost = $postModel->countAll();