app/Models/CommentsModel.php

    public function getTopCommentsWithUserInfo($postId, $count = 2)
    {
        $builder = $this->db->table('comments');
        $builder->select('comments.comment_id, comments.content, comments.total_comment_likes, users.username, users.profile_dp');
        $builder->join('users', 'comments.user_id = users.user_id');
        $builder->where('comments.post_id', $postId);
        $builder->orderBy('comments.total_comment_likes', 'DESC');
        $builder->limit($count);

        return $builder->get()->getResultArray();
---
SELECT "comments"."comment_id", "comments"."content", "comments"."total_comment_likes", "users"."username", "users"."profile_dp"
FROM "comments"
JOIN "users" ON "comments"."user_id" = "users"."user_id"
WHERE "comments"."post_id" = '24'
ORDER BY "comments"."total_comment_likes" DESC
 LIMIT 2