app/Models/PostSummaryModel.php

SELECT *
FROM "post_summary"
ORDER BY "uploaded_time" DESC
 LIMIT 4 OFFSET 10
---
        public function getPosts($limit, $offset)
    {
        return $this->orderBy('uploaded_time', 'DESC')->findAll($limit, $offset);