app/Models/StoriesModel.php

    public function getStoriesOfUserFromDb($user_id)
    {
        $query = $this->where('user_id', $user_id)
            ->where('uploaded_time >=', date('Y-m-d H:i:s', strtotime('-24 hours')))
            ->orderBy('uploaded_time', 'desc')
            ->get();
---
SELECT *
FROM "stories"
WHERE "user_id" = '34'
AND "uploaded_time" >= '2024-02-28 15:56:04'
ORDER BY "uploaded_time" DESC