app/Models/UsersModel.php

SELECT fname,lname, username, profile_dp
FROM "users"
WHERE "user_id" = '34'
 LIMIT 1
---
    public function getUserInfo($userId)
    {
        $query = $this->select('fname,lname, username, profile_dp', FALSE)
            ->where('user_id', $userId)
            ->first();

SELECT user_id,fname,lname, username, profile_dp,bio,background_img
FROM "users"
WHERE "user_id" = '32'
 LIMIT 1
---
    public function getUserProfileInfo($userId)
    {
        $query = $this->select('user_id,fname,lname, username, profile_dp,bio,background_img', FALSE)
            ->where('user_id', $userId)
            ->first();